{"1": {"riddle": "It is greater than God and more evil than the devil. The poor have it, the rich need it and if you eat it you’ll die. What is it?", "answer": "Nothing."}, "2": {"riddle": "It walks on four legs in the morning, two legs at noon and three legs in the evening. What is it?", "answer": "Man"}, "3": {"riddle": "I am the beginning of the end, and the end of time and space. I am essential to creation, and I surround every place. What am I?", "answer": "The letter e. End, timE, spacE, Every placE"}, "4": {"riddle": "What always runs but never walks, often murmurs, never talks, has a bed but never sleeps, has a mouth but never eats?", "answer": "A river."}, "5": {"riddle": "I never was, am always to be. No one ever saw me, nor ever will. And yet I am the confidence of all, To live and breath on this terrestrial ball. What am I?", "answer": "Tomorrow or the future."}, "6": {"riddle": "At night they come without being fetched. By day they are lost without being stolen. What are they?", "answer": "The stars."}, "7": {"riddle": "What is in seasons, seconds, centuries and minutes but not in decades, years or days?", "answer": "The letter ‘n’."}, "8": {"riddle": "The one who makes it, sells it. The one who buys it, never uses it. The one that uses it never knows that he’s using it. What is it?", "answer": "A coffin"}, "9": {"riddle": "The more you have of it, the less you see. What is it?", "answer": "Darkness"}, "10": {"riddle": "What has a head, a tail, is brown, and has no legs?", "answer": "A penny."}, "11": {"riddle": "What English word has three consecutive double letters?", "answer": "Bookkeeper."}, "12": {"riddle": "What’s black when you get it, red when you use it, and white when you’re all through with it?", "answer": "Charcoal."}, "13": {"riddle": "You throw away the outside and cook the inside. Then you eat the outside and throw away the inside. What did you eat?", "answer": "An ear of corn."}, "14": {"riddle": "I am always hungry, I must always be fed, the finger I touch, will soon turn red. What am I?", "answer": "Fire"}, "15": {"riddle": "Ripped from my mother’s womb, beaten and burned, I become a blood thirsty killer. What am I?", "answer": "Iron ore"}, "16": {"riddle": "I know a word of letters three. Add two, and fewer there will be!", "answer": "Few"}, "17": {"riddle": "I give you a group of three. One is sitting down, and will never get up. The second eats as much as is given to him, yet is always hungry. The third goes away and never returns.", "answer": "Stove, fire, smoke"}, "18": {"riddle": "I have four legs but no tail. Usually I am heard only at night. What am I?", "answer": "A frog. The frog is an amphibian in the order Anura (meaning “tail-less”) and usually makes noises at night during its mating season."}, "19": {"riddle": "Half-way up the hill, I see thee at last, lying beneath me with thy sounds and sights — A city in the twilight, dim and vast, with smoking roofs, soft bells, and gleaming lights.", "answer": "The past. (Longfellow)"}, "20": {"riddle": "When young, I am sweet in the sun. When middle-aged, I make you happy. When old, I am valued more than ever.", "answer": "Wine"}, "21": {"riddle": "All about, but cannot be seen, can be captured, cannot be held, no throat, but can be heard.", "answer": "Wind"}, "22": {"riddle": "If you break me, I do not stop working. If you touch me, I may be snared. If you lose me, nothing will matter. What am I?", "answer": "Your heart"}, "23": {"riddle": "Until I am measured I am not known, yet how you miss me when I have flown. What am I?", "answer": "Time"}, "24": {"riddle": "I drive men mad for love of me, easily beaten, never free. What am I?", "answer": "Gold"}, "25": {"riddle": "When set loose, I fly away, never so cursed, as when I go astray.", "answer": "A fart"}, "26": {"riddle": "Lighter than what I am made of, more of me is hidden than is seen.", "answer": "Iceberg"}, "27": {"riddle": "Each morning I appear to lie at your feet, all day I will follow no matter how fast you run, yet I nearly perish in the midday sun.", "answer": "Shadow"}, "28": {"riddle": "My life can be measured in hours, I serve by being devoured. Thin, I am quick. Fat, I am slow. Wind is my foe.", "answer": "A candle"}, "29": {"riddle": "I am seen in the water if seen in the sky. I am in the rainbow, a jay’s feather,and lapis lazuli.", "answer": "Blue"}, "30": {"riddle": "Glittering points that downward thrust, sparkling spears that never rust.", "answer": "Icicle"}, "31": {"riddle": "You heard me before, yet you hear me again, then I die, ’till you call me again.", "answer": "An echo"}, "32": {"riddle": "Three lives have I. Gentle enough to soothe the skin, light enough to caress the sky, hard enough to crack rocks.", "answer": "Water"}, "33": {"riddle": "At the sound of me, men may dream or stamp their feet. At the sound of me, women may laugh or sometimes weep.", "answer": "Music"}, "34": {"riddle": "What does man love more than life, fear more than death or mortal strife? What the poor have, the rich require, and what contented men desire, what the miser spends and the spendthrift saves, and all men carry to their graves?", "answer": "Nothing"}, "35": {"riddle": "I build up castles. I tear down mountains. I make some men blind, I help others to see. What am I?", "answer": "Sand"}, "36": {"riddle": "Two in a corner, one in a room, zero in a house, but one in a shelter. What am I?", "answer": "The letter r."}, "37": {"riddle": "Five hundred begins it, five hundred ends it, five in the middle is seen; First of all figures, the first of all letters, take up their stations between. Join all together, and then you will bring before you the name of an eminent king.", "answer": "DAVID (Roman numerals)"}, "38": {"riddle": "It cannot be seen, it weighs nothing, but when put into a barrel, it makes it lighter. What is it?", "answer": "A hole"}, "39": {"riddle": "How far will a blind dog walk into a forest?", "answer": "Halfway. After he gets halfway, he’s walking out of the forest."}, "40": {"riddle": "What happens when you throw a yellow rock into a purple stream?", "answer": "It makes a splash."}, "41": {"riddle": "What starts with a T, ends with a T, and has T in it?", "answer": "A teapot"}, "42": {"riddle": "As I went over London Bridge I met my sister Jenny, I broke her neck and drank her blood and left her standing empty.", "answer": "A bottle of gin"}, "43": {"riddle": "Whoever makes it, tells it not. Whoever takes it, knows it not. Whoever knows it, wants it not.", "answer": "Counterfeit money"}, "44": {"riddle": "I am, in truth, a yellow fork from tables in the sky, by inadvertent fingers dropped the awful cutlery, of mansions never quite disclosed and never quite concealed. The apparatus of the dark to ignorance revealed.", "answer": "Lightning"}, "45": {"riddle": "You saw me where I never was and where I could not be. And yet within that very place, my face you often see. What am I?", "answer": "A reflection"}, "46": {"riddle": "Say my name and I disappear. What am I?", "answer": "Silence"}, "47": {"riddle": "What is it that after you take away the whole, some still remains?", "answer": "Wholesome"}, "48": {"riddle": "A box without hinges, lock or key, yet golden treasure lies within. What is it?", "answer": "An egg"}, "49": {"riddle": "Forward I’m heavy, but backwards I’m not. What am I?", "answer": "Ton"}, "50": {"riddle": "Why doesn’t a mountain covered with snow catch cold?", "answer": "Because it has a snowcap🙂"}, "51": {"riddle": "I can be long, or I can be short, I can be grown, and I can be bought, I can be painted, or left bare, I can be round, or square. What am I?", "answer": "A fingernail"}, "52": {"riddle": "One by one we fall from heaven down into the depths of past, and our world is ever upturned so that yet some time we’ll last.", "answer": "Sands in an hourglass"}, "53": {"riddle": "I drift forever with the current down these long canals they’ve made, tame, yet wild, I run elusive Multitasking to your aid. Before I came, the world was darker, colder, sometimes, rougher, true, but though I might make living easy, I’m good at killing people too.", "answer": "Electricity (or lightning)"}, "54": {"riddle": "Reaching stiffly for the sky, I bare my fingers when it’s cold. In warmth I wear an emerald glove and in between I dress in gold", "answer": "A deciduous tree"}, "55": {"riddle": "Kings and queens may cling to power and the jester’s got his call, but, as you may all discover, the common one outranks them all.", "answer": "An ace (in a deck of cards)"}, "56": {"riddle": "Every dawn begins with me, at dusk I’ll be the first you see, and daybreak couldn’t come without what midday centers all about. Daises grow from me, I’m told. And when I come, I end all cold, but in the sun I won’t be found, yet still, each day I’ll be around.", "answer": "The letter d."}, "57": {"riddle": "Kings and lords and christians raised them, since they stand for higher powers, yet few of them would stand, I’m certain, if men ruled this world of ours.", "answer": "A tower."}, "58": {"riddle": "Soft and fragile is my skin, I get my growth in mud. I’m dangerous as much as pretty, for if not careful, I draw blood.", "answer": "A thorn"}, "59": {"riddle": "Three brothers share a family sport: A non-stop marathon. The oldest one is fat and short And trudges slowly on the middle brother’s tall and slim and keeps a steady pace. The youngest runs just like the wind, a speeding through the race. “He’s young in years, we let him run,” the other brothers say “‘Cause though he’s surely number one, he’s second, in a way.”", "answer": "The hands on a clock (hour, minute, second)."}, "60": {"riddle": "It’s true I bring serenity, and hang around the stars, but yet I live in misery; You’ll find me behind bars with thieves and villains I consort. In prison I’ll be found, but I would never go to court, unless there’s more than one", "answer": "The letter s"}, "61": {"riddle": "I am a box that holds keys without locks, yet they can unlock your soul. What am I?", "answer": "A piano."}, "62": {"riddle": "There once was a strange man who loved wordplay, he had a very important and successful business that would take insect shipments from all across the world and distribute them to zoos across the US. What's his company name?", "answer": "ImportANT"}, "63": {"riddle": "There is one word that stands the test of time and holds fast to the center of everything. Though everyone will try at least once in their life to move around this word, but in fact, unknowingly, they use it every moment of the day. Young or old, awake or in sleep, human or animal, this word stands fast. It belongs to everyone, to all living things, but no one can master it. The word is?", "answer": "Gravity"}, "64": {"riddle": "My days are in the summer. When you’ll eat me when I’m hot. In fact I’ll even eat myself where battles tough are fought, but when you find me in a fight, ‘twill be high in the sky, and if you catch me napping, I suggest you let me lie. When you’re bad, come to my house, from Ma get thoughts profound. Am I big or am I small? Some say I’m just a pound.", "answer": "Dog. Dog days, hot dog, dog pound, dog fight."}, "65": {"riddle": "My first is twice in apple but not once in tart. My second is in liver but not in heart. My third is in giant and also in ghost. Whole I’m best when I am roast. What am I?", "answer": "A pig."}, "66": {"riddle": "What gets wetter as it dries?", "answer": "A towel"}, "67": {"riddle": "This is a most unusual paragraph. How quickly can you find out what is so unusual about it? It looks so ordinary, you’d think nothing was wrong with it – and in fact, nothing is wrong with it. It is unusual though. Why? Study it, think about it, and you may find out. Try to do it without coaching. If you work at it for a bit it will dawn on you. So jump to it and try your skill at figuring it out. Good luck – don’t blow your cool!", "answer": "The most common letter in the English language, the letter e, is not found in the entire paragraph."}, "68": {"riddle": "When you went into the woods you got me. You hated me yet you wanted to find me. You went home with me cause you couldn’t find me. What was it?", "answer": "A splinter"}, "69": {"riddle": "An iron horse with a flaxen tail. The faster the horse runs, the shorter his tail becomes. What is it?", "answer": "A needle and thread."}, "70": {"riddle": "You have to travel far before you turn it over. What is it?", "answer": "An odometer"}, "71": {"riddle": "A mile from end to end, yet as close to as a friend. A precious commodity, freely given. Seen on the dead and on the living. Found on the rich, poor, short and tall, but shared among children most of all. What is it?", "answer": "A smile."}, "72": {"riddle": "I’m full of holes, yet I’m full of water. What am I?", "answer": "A sponge"}, "73": {"riddle": "Four of us are in your field, but our differences keep us at yield. First, a one that is no fool, though he resembles a gardener’s tool. Next, one difficult to split in two, and a girl once had one as big as her shoe. Then, to the mind, one’s a lovely bonder, and truancy makes it grow fonder. Last, a stem connecting dots of three. Knowing all this, what are we?", "answer": "The four suits in a deck of standard playing cards. The Spade is a gardener’s tool. The Diamond is the hardest gem to break. “Little Girl and Queen” is a Mother Goose rhyme, in which the Queen gave the girl a large diamond for picking the Queen some roses.The Heart bonds with the mind to form love. Absence makes the heart grow fonder.The Club, or Clover, is three dots connected around a stem."}, "74": {"riddle": "I am a word of meanings three. Three ways of spelling me there be. The first is an odour, a smell if you will. The second some money, but not in a bill. The third is past tense, a method of passing things on or around. Can you tell me now, what these words are, that have the same sound?", "answer": "Scent, cent, sent"}, "75": {"riddle": "It’s red, blue, purple and green, no one can reach it, not even the queen. What is it?", "answer": "A rainbow."}, "76": {"riddle": "What question can you never honestly answer yes to?", "answer": "Are you asleep? (or dead)"}, "77": {"riddle": "What has a neck and no head, two arms but no hands?", "answer": "A shirt (or sweater, jacket etc)"}, "78": {"riddle": "I live in water. If you cut my head I’m at your door, if you cut my tail I’m fruit, if you cut both I’m with you. What am I?", "answer": "A pearl. They’re found underwater. Removing the head (p) leaves Earl, a guy who could be at your door. Removing the tail (l) leaves pear, a fruit and if you cut both off you’re left with ear, which is with you because it’s attached to your head."}, "79": {"riddle": "Feed me and I live, give me drink and I die. What am I?", "answer": "Fire."}, "80": {"riddle": "What begins and has no end? What is the ending of all that begins?", "answer": "The best answer I’ve heard is death. It ends all that begins, and there’s no end to death. Another answer along the same lines is decay."}, "81": {"riddle": "A man went to the hardware store to buy items for his house. 1 would cost $.25. 12 would cost $.50. 122 would cost $.75. When he left the store he had spent $.75, what did he buy?", "answer": "House numbers"}, "82": {"riddle": "What makes a loud noise when changing its jacket, becomes larger but weighs less?", "answer": "Popcorn"}, "83": {"riddle": "The more you take, the more you leave behind. What am I?", "answer": "Footsteps"}, "84": {"riddle": "I am a word of 5 letters and people eat me. If you remove the first letter I become a form of energy. Remove the first two and I’m needed to live. Scramble the last 3 and you can drink me. What am I?", "answer": "Wheat, heat, eat, tea"}, "85": {"riddle": "Before any changes I’m a garlic or spice. My first is altered and I’m a hand-warming device. My second is changed and I’m trees in full bloom. The next letter change makes a deathly old tomb. Change the fourth to make a fruit of the vine. Change the last for a chart plotted with lines. What was I? What did I become? What did I turn out to be?", "answer": "Clove, glove, grove, grave, grape, graph"}, "86": {"riddle": "A woman shoots her husband, then holds him under water for five minutes. Finally, she hangs him. Five minutes later they enjoy a wonderful dinner together. How can this be?", "answer": "She took a photo of him and developed it in the dark room."}, "87": {"riddle": "Remove six letters from this sequence to reveal a familiar English word. BSAINXLEATNTEARS", "answer": "BANANAS (Removed SIX LETTERS)"}, "88": {"riddle": "Alive without breath, as cold as death. Clad in mail never clinking, never thirsty, ever drinking. What am I?", "answer": "A fish"}, "89": {"riddle": "With thieves I consort. With the vilest, in short, I’m quite at ease in depravity; Yet all divines use me, and savants can’t lose me, for I am the center of gravity.", "answer": "The letter V"}, "90": {"riddle": "Until I am measured, I am not known, yet how you miss me, when I have flown.", "answer": "Time"}, "91": {"riddle": "I never was, am always to be. No one ever saw me, nor ever will, and yet I am the confidence of all to live and breathe on this terrestrial ball.", "answer": "Tomorrow"}, "92": {"riddle": "Alive without breath, as cold as death. Never thirsty, ever drinking. Clad in mail, never clinking. Drowns on dry land, thinks an island is a mountain. Thinks a fountain, is a puff of air.", "answer": "A fish"}, "93": {"riddle": "This thing all things devours: Birds, beasts, trees, flowers. Gnaws iron, bites steel; Grinds hard stones to meal; Slays king, ruins town, and beats high mountain down.", "answer": "Time"}, "94": {"riddle": "The cost of making only the maker knows, valueless if bought, but sometimes traded. A poor man may give one as easily as a king. When one is broken pain and deceit are assured. What is it?", "answer": "Promise"}, "95": {"riddle": "Who makes it, has no need of it. Who buys it, has no use for it. Who uses it can neither see nor feel it.", "answer": "A coffin"}, "96": {"riddle": "I build up castles. I tear down mountains. I make some blind, I help others to see. What am I?", "answer": "Sand"}, "97": {"riddle": "Glittering points that downward thrust, sparkling spears that never rust. What am I?", "answer": "Icicle"}, "98": {"riddle": "Die without me, never thank me. Walk right through me, never feel me. Always watching, never speaking. Always lurking, never seen.", "answer": "Air"}, "99": {"riddle": "Pregnant every time you see her, yet she never will give birth.", "answer": "Full moon"}, "100": {"riddle": "I go around in circles, but always straight ahead. Never complain, no matter where I am led.", "answer": "Wheel"}, "101": {"riddle": "How do you make 30 cents with two coins if one of them is not a quarter?", "answer": "A quarter and a nickel. One is not a quarter, but the other one is."}, "102": {"riddle": "A couple went on for a climbing trip. But only the husband returned from the vacation and said that his wife slipped off while climbing and died. On investigating, the local sheriff arrested him saying, 'Your travel agent called. You murdered your wife.' The man did not inform anyone about the trip. Then how did the agent was so sure that it is a murder?", "answer": "The man bought only one way ticket for his wife whereas he bought two way ticket for himself. It means that he was sure that he will be returning alone."}, "103": {"riddle": "There was a girl who was extremely brave and always bragged about how brave she was. Many of her classmates got sick and tired of her boasting, so they decided to play a trick on her. One day, a group of boys and girls walked up to her and said, \" If you're so brave, we all dare you to go to the old graveyard at the back of Ol' Man Jenkins mansion all alone at midnight. Stand in front of a tombstone, rumor has it that if you do, a bony hand will reach out and grab you, dragging you underground! You said you were brave so that shouldn't be so hard! To prove that you actually went, stick a knife in front of a tombstone so in the morning, we'll know you were there.\" Of course, the girl couldn't refuse and agreed to the dare. At midnight, she did just as her classmates asked and went to the graveyard with a pocketknife. The night was cold and windy, blowing her dress, chills went up her spine. She slowly walked up to a tombstone and quickly stuck the pocket knife into the ground. She was beginning to feel not as brave as she thought she was. Turning around as fast as she could, she just wanted to get out of there right away! But, there was a problem. Something was stopping her from moving. Was it a bony hand trying to drag her down? A shrill scream was heard. The next morning, the boys and girls went to the graveyard to see if the girl had been there. To their horror, she was there, dead.", "answer": "The girl was wearing a dress at the graveyard. It was dark, so she hadn't noticed where she stuck the knife in the ground. She accidently stuck it in her dress (and the girl DID NOT get hurt by the knife in any way). That is what prevented her from running away. Since the knife had her stuck, she was frighted that the rumor of the bony hand was true and had grabbed her, trying to pull her into the ground. She was truly terrified and died of fright."}, "104": {"riddle": "Evianna meets a man while attending her mothers funeral. She becomes infatuated with him and he reciprocates the interest, but he leaves the funeral without giving her any contact information. She tries to locate him but is unsuccessful. Several days later she kills her sister.", "answer": "Because shes a psychopath. She killed her sister because she hoped the man would attend the funeral and she would get to see him again. This is one brain teaser that is probably best that you dont get the correct answer. If you knew the answer right away and thought it was obvious, you may want to talk to someone."}, "105": {"riddle": "There was a person laying dead in the middle of the grass field with nothing but a weird kind of rock next to him. Also the nearest building was 50 miles away. And the man that was found dead was wearing the colors red, yellow, and blue. So who was the man and was the rock from earth?", "answer": "Superman"}, "106": {"riddle": "Adam killed his wife in front of so many people. Yet, no one has the power to accuse him of the murder and send him to prison for his crime. How?", "answer": "This is because Adam is a hangman by profession. Apparently, his wife has been sentenced to death and he had to do it with his own hands"}, "107": {"riddle": "A homicide detective is called at a crime scene. A man is lying dead in front of an abandoned building. It is believed that the man jumped out of a window off the abandoned building and committed suicide. The detective asks his team to collect evidence and he heads towards the building. He goes to the first floor and towards the room that is on the front side. Inside the room, he lights a cigarette, walks towards the window facing the dead body, opens the window and throws out the cigarette. He then goes to the second floor and repeats the same process. He keeps doing the same thing till he is done with all the floors and then takes the lift to the ground floor. Upon reaching there, he informs the team that it is not a suicide but a murder. How did he know it was not a suicide?", "answer": "If the man had committed suicide, the window that he jumped from should have been left opened. But all the windows facing the dead body were closed. This means that someone closed the window after the man died."}, "108": {"riddle": "My wife was attacked by a burglar when I was on my way home from work. She stabbed him with a butcher knife and killed him. The police say it was an obvious case of self-defense. When I went to pick her up from the police station, she said. - \"When I heard the doorbell I thought it was you, but then a masked man jumped me as soon as I opened the door!\" - \"You must have been so scared\" - I said - \"But you're safe now\" - I hugged her tightly. How did she kill the burglar so fast when he attacked her at the door?", "answer": "His wife came to the door with a butcher knife because she thought her husband was coming home. She was planning to kill the husband."}, "109": {"riddle": "My neighbors think I'm a nosy old woman, but today I witnessed a murder. I was looking out my window when I saw something through the window of the apartment building opposite me. A man was in the middle of murdering a woman. The strange thing was, after he finished strangling her, he turned around and our eyes met. It was eerie. Then he pointed at me and kept staring at me for a minute or two. All the time he was staring at me, his finger kept moving. I called the police a few minutes ago and they told me I will have to go down to the police station and give a statement tomorrow. I'm sure they will catch him. I saw his face very clearly. What do you think the murderer was waving his finger at?", "answer": "The murderer was counting the windows to see which floor the old woman was on. He is coming to kill her."}, "110": {"riddle": "A woman and a man go on a date. While on their date, the woman shoots the man, drowns the man, and hangs the man. the next night, the same man and woman go on a date and both of them are 100% fine. how is this possible?", "answer": "The woman shoots a picture of him, drowns the picture to develop it, then she hangs the picture"}}